import { Gift } from "lucide-react";
import { ad, ad2, amazon, apple, fortnite, itunes, ludo, net, playstation, product1,pubg, razer, stc, talabat, xbox } from "../assets";

export const cartData = [
   {
        productName:'PlayStation Store UAE $21',
        proudctImg:product1,
        prouductPrice:10,
        quantity:1,

     },
     {
        productName:'PlayStation Store UAE $21',
        proudctImg:pubg,
        prouductPrice:100,
        quantity:2
     },
     {
        productName:'PlayStation Store UAE $21',
        proudctImg:pubg,
        prouductPrice:22.99,
        quantity:6
     }

]
export const service = [
   {
    name:'هدابــا',
    icon:Gift 
  },
  {
   name:'هدابــا',
   icon:Gift
 },
 {
   name:'هدابــا',
   icon:Gift
 },
 {
   name:'هدابــا',
   icon:Gift
 },
 {
   name:'هدابــا',
   icon:Gift
 },
 {
   name:'هدابــا',
   icon:Gift
 },
 {
   name:'هدابــا',
   icon:Gift
 }
]
export const popularCards = [
  {
  productName:'PlayStation Store UAE $21',
  proudctImg:product1,
  prouductPrice:22,
},
{
  productName:'PUBG Mobile 60 UC',
  proudctImg:pubg,
  prouductPrice:0.90 ,
},
{
  productName:'App Store & iTunes US $30 ',
  proudctImg:itunes,
  prouductPrice:90 ,
},
{
  productName:'Amazon US $10',
  proudctImg:fortnite,
  prouductPrice:0.90 ,
},
{
  productName:'PUBG Mobile 60 UC',
  proudctImg:amazon,
  prouductPrice:0.90 ,
},


]
export const sectionData =[ 
  {
  sectionName:'بطاقات ألعاب',
  sectionImg:ludo,
  },
{
  sectionName:' بطاقات متاجر التطبيقات ' ,
  sectionImg:apple,
},
{
  sectionName:' بطاقات الموبايل والإنترنت ',
  sectionImg:stc
},
  
{
  sectionName:' بطاقات أجهزة التحكم في الألعاب',
  sectionImg:xbox,
  
},
{
  sectionName:'بطاقات  الأغاني والأفلام',
  sectionImg:net,
  
},
{
  sectionName:'بطاقات  المحافظ الإلكترونية',
  sectionImg:razer,
  
},
{
  sectionName:'بطاقات هدايا المتاجر',
  sectionImg:talabat,
  
},
]
export const adsSection = [
  {
    ad:ad
  },
  {
    ad:ad2
  }
]

export const Card =[
   {
    name:'PlayStation Store UAE $21',
    img:playstation,
    price:21 ,
    available:true
   },
   {
    name:'PUBG Mobile 60 UC',
    img:pubg,
    price:0.90,
    available:true
   },
   {
    name:'App Store & iTunes US $30 ',
    img:itunes,
    price:21 ,
    available:false
   },
   {
    name:'Amazon US $10',
    img:fortnite,
    price:100 ,
    available:true
   },
   {
    name:'Amazon US $10',
    img:amazon,
    price:100 ,
    available:true
   },
   {
    name:'PlayStation Store UAE $21',
    img:playstation,
    price:21 ,
    available:false
   },
   {
    name:'PUBG Mobile 60 UC',
    img:pubg,
    price:0.90,
    available:true

   },
   {
    name:'App Store & iTunes US $30 ',
    img:itunes,
    price:21 ,
    available:false
   },
   {
    name:'Amazon US $10',
    img:fortnite,
    price:100 ,
    available:true
   },
   {
    name:'Amazon US $10',
    img:amazon,
    price:100 ,
    available:true
   },
]
// export const website =[
// {
//   privacy:<><h1 className="font-bold text-xl my-2">
//   معلومات عنا
//   </h1>
//   <p className="leading-7 mx-5"> اشتري بطاقات الهدايا المدفوعة مسبقا عبر الإنترنت على <strong>www.marveleza.shop</strong> .<br/> في توفير تجربة لعب مثيرة وآمنة لكل شخص يحتاج إليها! اشتر بطاقات marveleza.shop تتمثل المهمة الرئيسية لـ وكن مستعدا لإنفاق النقاط والائتمانات من بطاقة الهدايا الخاصة بك للعب ألعابك marveleza.shop الهدايا من المفضلة عبر الإنترنت أو لتنزيل الألعاب لمنصتك بالإضافة إلى الحصول على خيارات وميزات إضافية من شأنها تحسين جودة اللعبة المختارة . اختر وشراء نقاط اللعبة وقسائم الائتمان . بطاقات marveleza.shop عندما يحتفل أحد أفراد عائلتك أو أصدقائك بعيد ميلاده أو تقترب العطلات؟ يقدم لك موقع هدايا مدفوعة مسب ًقا لأي مناسبة: يمكن لأصدقائك الحصول على نقاط الألعاب والرصيد لإنفاقها في ألعابهم المفضلة، ويمكن لأفراد عائلتك استرداد رموز قسيمة الهدايا الخاصة بهم والتسوق - كل هذا وأكثر متاح الآن مع مجموعة واسعة marveleza.shop !من البطاقات المدفوعة مسب ًقا وبطاقات الهدايا على موقع </p>
//   <h1 className="font-bold text-xl my-2">سياسة الخصوصية</h1>
//   <p className="leading-7 mx-5">
//   هو موقع إلكتروني ("الموقع الإلكتروني") مملوك ومدار من قبل، والذي تم تأسيسه /https://marveleza.shop بموجب قوانين دولة الإمارات العربية المتحدة، ، الإمارات العربية المتحده. من خلال شراء واستخدام المنتجات والخدمات فإنك توافق على سياسة الخصوصية هذه، كما توافق على جمع معلوماتك ،/https://marveleza.shop المقدمة على الشخصية واستخدامها والإفصاح عنها وف ًقا للأحكام الواردة أدناه . هناك طرق مختلفة يمكنك من خلالها التفاعل مع موقعنا الإلكتروني وخدماتنا، ويتم معالجة المعلومات التي تقدمها عند . .القيام بذلك وتخزينها بأفضل طريقة ممكنة لاتستهدفخدماتناالأفرادالذينتقلأعمارهمعن18عاًما.ولانجمعأونعالجالبياناتالشخصيةمنالقاصرينعن عمد، وسيتم حذف أي بيانات من هذا القبيل على الفور إذا تم التعرف عليها. إذا كنت تعتقد أننا جمعنا مثل هذه المعلومات، يرجى الاتصال بنا على الفور .
//   </p>
//   <h1 className="font-bold text-xl my-2">التعاريف</h1>
//   <p className="leading-7 mx-5">
//   البيانات الشخصية" تعني أي معلومات تتعلق بشخص طبيعي محدد أو قابل للتحديد ("موضوع البيانات")؛ الشخص الطبيعي القابل للتحديد هو الشخص الذي يمكن تحديده، بشكل مباشر أو غير مباشر، وخاصة عن طريق الإشارة إلى معرف مثل الاسم أو رقم التعريف أو بيانات الموقع أو معرف عبر الإنترنت أو إلى عامل أو أكثر خاص بالهوية الجسدية أو الفسيولوجية أو الجينية أو العقلية أو الاقتصادية أو الثقافية أو الاجتماعية لهذا الشخص الطبيعي؛ . المعالجة" تعني أي عملية أو مجموعة من العمليات التي يتم إجراؤها على البيانات الشخصية أو على مجموعات من البيانات الشخصية، سواء بوسائل آلية أم لا، مثل التجميع والتسجيل والتنظيم والهيكلة والتخزين والتكييف أو التغيير والاسترجاع والاستشارة والاستخدام والإفصاح عن طريق الإرسال أو النشر أو إتاحتها بطريقة أخرى أو المحاذاة أو الجمع أو التقييد أو المحو أو التدمير؛ . المسؤول" يعني الشخص الطبيعي أو القانوني أو السلطة العامة أو الوكالة أو الهيئة الأخرى التي تحدد، بمفردها أو بالاشتراك مع آخرين، أغراض ووسائل معالجة البيانات الشخصية؛ . المعالج" يعني شخ ًصا طبيع ًيا أو اعتبار ًيا أو سلطة عامة أو وكالة أو هيئة أخرى تعالج البيانات الشخصية نيابة عن المتحكم؛ . المستلم" يعني شخ ًصا طبيع ًيا أو اعتبار ًيا أو سلطة عامة أو وكالة أو هيئة أخرى يتم الكشف لها عن البيانات الشخصية، .سواء كان طرفًا ثالثًا أم لا . الطرف الثالث" يعني شخ ًصا طبيع ًيا أو اعتبار ًيا أو سلطة عامة أو وكالة أو هيئة أخرى غير صاحب البيانات أو المتحكم أو المعالج والأشخاص الذين، بموجب السلطة المباشرة للمتحكم أو المعالج، مخولون بمعالجة البيانات الشخصية؛ . تعني "موافقة" صاحب البيانات أي إشارة حرة ومحددة ومستنيرة ولا لبس فيها لرغبات صاحب البيانات والتي من خلالها يعرب هو أو هي، من خلال بيان أو إجراء إيجابي واضح، عن موافقته على معالجة البيانات الشخصية المتعلقة به أو بها؛
//   </p>
//   <h1 className="font-bold text-xl my-2">ما هي البيانات الشخصية التي نجمعها؟</h1>
//   <p className="leading-7 mx-5">
//   معلومات الهوية، مثل اسمك، واسم شركتك، ونوع المنظمة بيانات الاتصال، مثل عنوانك وعنوان بريدك الإلكتروني ورقم هاتفك ومقابض وسائل التواصل الاجتماعي . إثبات الهوية/إثبات العنوان، مثل نسخة من بطاقة الهوية أو جواز السفر أو شهادة التسجيل . ونوع المتصفح وإصداره، وإعدادات المنطقة الزمنية والموقع، وأنواع )IP( البيانات الفنية، مثل عنوان بروتوكول الإنترنت وإصدارات إضافات المتصفح، ونظام التشغيل والمنصة والتكنولوجيا الأخرى على الأجهزة التي تستخدمها للوصول إلى .موقع الويب بيانات الاستخدام، والتي تتضمن معلومات حول كيفية استخدامك للموقع الإلكتروني وخدماتنا، وأي اتصالات قد نتلقاها .منك .بيانات التسويق والاتصالات، بما في ذلك تفضيلاتك في تلقي التسويق والاتصالات الأخرى منا .البيانات المالية، والتي يتم تخزينها بشكل مشفر وآمن يجب أن تكون البيانات الشخصية التي تقدمها لنا دقيقة ومحدثة. قد يؤدي عدم تقديم مثل هذه المعلومات إلى فرض قيود على استخدام خدمات
//   </p>
//   <h1 className="font-bold text-xl my-2">
//      كيف نستخدم البيانات الشخصية؟ </h1>
//   <p className="leading-7 mx-5">
//   نحن نستخدم معلوماتك الشخصية . لتفعيل حسابك وتزويدك بجميع الخدمات على الموقع الإلكتروني. وكجزء من عملياتنا التجارية الروتينية، نقوم بمعالجة معلومات البنوك وبطاقات الائتمان/الخصم والتحقق من الهوية من خلال أطراف ثالثة .للتحقق من دقة البيانات. يتم تخزين جميع البيانات المالية في نموذج مشفر وآمن الغرض من هذه الفحوصات هو تحديد هوية العملاء والتحقق منها، والحد من الاحتيال وغير ذلك من المخاطر المالية أو التشغيلية على موقعنا الإلكتروني. في حالة عدم إمكانية تحديد هوية المستخدم بشكل مؤكد، يحق لمسؤول البيانات/ .المعالج إعادة طلب أي بيانات شخصية منك كما نستخدم بياناتك الشخصية مع معلومات أخرى لأغراض الإدارة والتسويق وخدمة العملاء
//   </p>
//   <h1 className="font-bold text-xl my-2">
//   الأساس القانوني</h1>
//   <p className="leading-7 mx-5">
//   الموافقة - لن نستخدم بياناتك الشخصية إلا للإعلان والتسويق وتخصيص المحتوى والخدمات والأغراض التحليلية وتتبع المشتريات إذا حصلنا على موافقتك الصريحة على ذلك. ويشمل ذلك استخدام البيانات التي تقدمها أنت وشركاؤنا .بهدف تحسين منتجاتنا وخدماتنا في نهاية المطاف المصالح المشروعة - المصالح المشروعة التي نسعى إلى تحقيقها هي معالجة طلبك وتسليمه وجمع الدفعة الخاصة به بشكل صحيح، والاحتفاظ بالسجلات ذات الصلة بعلاقاتنا مع العملاء، وتحليل حركة المرور على الموقع الإلكتروني والمنتجات/الخدمات المستخدمة، وتطويرها بشكل أكبر وتنمية أعمالنا، دون الإخلال بالتدابير الوقائية الكافية ضد .الاحتيال والاختراق وأي خروقات للبيانات .تنفيذ العقد - عند شراء منتج أو خدمة منا، سنحتاج إلى معالجة تفاصيلك حتى نتمكن من توفير المنتج لك الالتزامات القانونية والقضائية - نحتاج إلى معالجة بياناتك للامتثال للالتزامات القانونية التي نشأت لمجموعة أطراف .ثالثة والسلطات وف ًقا لقوانين دولة الإمارات العربية المتحدة
//   </p>
//   <h1 className="font-bold text-xl my-2">
//   نقل البيانات الشخصية</h1>
//   <p className="leading-7 mx-5">
//   بجمع وتخزين المعلومات من جميع مستخدمي الموقع الإلكتروني ومنتجاته وخدماته. يتم نقل هذه المعلومات ومعالجتها وتخزينها خارج بلد إقامة المستخدم، إلى أي مكان نعمل فيه لغرض تقديم الخدمات. كلما نقلنا معلوماتك، فإننا نتخذ :خطواتلحمايتهاتماًما.يجوزلنانقلبياناتكالشخصيةخارجبلدإقامتكفيالحالاتالتالية بنا ًء على الموافقة الطوعية المعلنة - يجوز لك تقديم موافقة صريحة على النقل خارج البلاد؛ من أجل الوفاء بالالتزامات التعاقدية - يكون النقل ضرور ًيا لإبرام العقد أو تنفيذه؛ الالتزامات القانونية والقضائية - يكون النقل ضرور ًيا لتنفيذ الالتزامات وإثبات الحقوق أو ممارستها أو الدفاع عنها أمام السلطات القضائية؛ .لحماية المصلحة العامة
//   </p>
//   <h1 className="font-bold text-xl my-2">
//   الاحتفاظ بالبيانات الشخصية</h1>
//   <p className="leading-7 mx-5">
//   لن يتم الاحتفاظ بمعلوماتك الشخصية لفترة أطول مما هو ضروري ومسموح به قانونًا لتحقيق الأغراض المحددة الموضحة في سياسة الخصوصية هذه وللسماح لنا بالامتثال لمتطلباتنا القانونية
//   </p>
//   <h1 className="font-bold text-xl my-2">
//   لإفصاح عن البيانات الشخصية
//   </h1>
//   <p className="leading-7 mx-5">
//   يجوز لنا تقديم معلومات شخصية مثل اسمك وعنوانك وبلد إقامتك إلى موردينا بهدف تحسين عملية الدفع وتوفيق .العمليات التجارية ومكافحة الاحتيال وغسيل الأموال نطلب من جميع متلقي بياناتك الشخصية احترام أمنها ومعالجتها وف ًقا للقانون. لا نسمح لمقدمي الخدمات التابعين لجهات خارجية باستخدام بياناتك الشخصية لأغراضهم الخاصة ونسمح لهم فقط بمعالجة بياناتك الشخصية لأغراض .محددة ووف ًقا لتعليماتنا نحتفظ بالحق في الكشف عن معلوماتك الشخصية امتثالاً للقوانين السارية وطلبات المعلومات القانونية من الهيئات الحكومية أو التنظيمية. قد يتم الكشف عن المعلومات أي ًضا بسبب متطلب قانوني علينا أو بموجب أمر قضائي 
//   </p>
//   <h1 className="font-bold text-xl my-2">
//   حقوقك
//   </h1>
//   <p className="leading-7 mx-5">
//   حق الوصول - لديك الحق في طلب نسخة من البيانات التي نحتفظ بها عنك؛ حق التصحيح - لديك الحق في تصحيح البيانات التي نحتفظ بها عنك والتي تكون غير دقيقة أو غير كاملة؛ الحق في النسيان - يمكنك طلب تصحيح البيانات التي نحتفظ بها عنك أو محوها من سجلاتنا. يقتصر الحق على الظروف مثل:<br/> 1. إذا كانت البيانات مطلوبة لأسباب تتعلق بالصحة العامة ، ؛<br /> 2. إذا كانت البيانات مطلوبة لإجراءات قانونية أو تحقيقية أو إذا كان الحذف يتعارض مع قوانين أخرى؛ <br />. الحق في تقييد المعالجة - يمكنك أن تطلب منا تقييد كيفية معالجتنا لبياناتك؛<br /> . الحق في النقل - لديك الحق في نقل البيانات التي نحتفظ بها عنك إلى منظمة أخرى؛ <br/> الحق في الاعتراض - لديك الحق في الاعتراض على معالجتنا لبياناتك عندما نعتمد على مصلحة مشروعة لمعالجتها؛ <br />. الحق في سحب موافقتك - لديك الحق في سحب موافقتك في أي وقت؛ <br />. الحق في الاعتراض على اتخاذ القرارات الآلية، بما في ذلك إنشاء الملفات الشخصية . <br />يرجى ملاحظة أن هذه الحقوق ليست مطلقة، وتطبق عليها بعض الاستثناءات قد يحتوي موقعنا على روابط من وإلى مواقع ويب تابعة لجهات خارجية.<br/> يرجى العلم بأننا لسنا مسؤولين عن سياسات الخصوصية الخاصة بها. <strong className="text-red-600"> نوصي بشدة بقراءة بيانات الخصوصية </strong>هذه قبل إرسال أي بيانات شخصية إلى هذه المواقع<br />
//   <strong>السيطرة على المعلومات الشخصية</strong> <br />
//   في حالة حدوث أي تغيير في بياناتك الشخصية، فإنك مسؤول عن تحديث هذه البيانات في حسابك في الوقت المناسب - .إما يدو ًيا عن طريق تسجيل الدخول أو طلب المساعدة من دعم العملاء .نحن نتنصل من المسؤولية عن أي خسائر ناجمة عن فشلك في الحفاظ على سرية بياناتك إذا كنت ترغب في إغلاق حسابك، فيتعين عليك الاتصال بخدمة العملاء لدينا. نحن ملتزمون بالحفاظ على بعض سجلاتك لفترة لا تقل عن خمس سنوات بعد إغلاق الحساب<br />
//   <strong>ملفات تعريف الارتباط</strong> <br />
//   نحن نستخدم ملفات تعريف الارتباط وتقنيات التتبع المماثلة لتتبع النشاط على موقعنا الإلكتروني، وتخزين معلومات .معينة، وتحليل خدماتنا وتحسينها ملف تعريف الارتباط هو ملف صغير يتم وضعه على جهازك. يمكنك توجيه متصفحك لرفض جميع ملفات تعريف الارتباط أو الإشارة عند إرسال ملف تعريف ارتباط. ومع ذلك، إذا لم تقبل ملفات تعريف الارتباط، فقد لا تتمكن من استخدام بعض أجزاء من خدماتنا. يمكن أن تكون ملفات تعريف الارتباط "مستمرة" أو "جلسة". تظل ملفات تعريف الارتباط المستمرة على جهاز الكمبيوتر الشخصي أو الجهاز المحمول الخاص بك عند عدم الاتصال بالإنترنت، بينما يتم حذف .ملفات تعريف ارتباط الجلسة بمجرد إغلاق متصفح الويب نحن نستخدم ملفات تعريف الارتباط الخاصة بالجلسة والمستمرة لتزويدك بالخدمات المتاحة عبر الموقع وتمكين بعض ميزاتها. تساعد ملفات تعريف الارتباط في التحقق من صحة المستخدمين ومنع الاستخدام الاحتيالي لحسابات .المستخدم. كما أنها تتذكر خياراتك عند استخدام الموقع، مثل تذكر تفاصيل تسجيل الدخول أو تفضيلات اللغة تتيح لنا ملفات تعريف الارتباط تتبع حركة المرور إلى الموقع وكيفية استخدام المستخدمين للموقع. قد تحدد المعلومات التي يتم جمعها عبر ملفات تعريف الارتباط هذه هويتك بشكل مباشر أو غير مباشر كزائر فردي. قد نستخدمها أي ًضا لاختبار الصفحات الجديدة أو الميزات أو وظائف الموقع الجديدة لمعرفة كيفية تفاعل مستخدمينا معها

//   </p>
//   <h1 className="font-bold text-xl my-2">
//   إشعار بالتغييرات
//   </h1>
//   <p className="leading-7 mx-5">من وقت لآخر، قد نجري تغييرات على سياسة الخصوصية هذه. وقد يكون ذلك فيما يتعلق بتغييرات في القانون أو أفضل الممارسات أو تغييرات في خدماتنا. وسيتم تسليط الضوء على أحدث تاريخ سريان في الجزء العلوي من معلومات السياسة</p>
//   <h1 className="font-bold text-xl my-2">
//   كيفية الاتصال بنا</h1>
//   <p className="leading-7 mx-5">
//   البريد لاكتروني : <strong>marvelezashop@gmail.com.</strong> : دبي الإمارات العربية المتحدة

//   </p></>
// }
// ]